#include <iostream>

/*
Задача 4. Барберы (необязательная).

В небольшом городке проживает 18 000 взрослых человек: 9 000 мужчин и 9 000
женщин. Согласно традиции этого городка все мужчины обязаны носить бороду.
Один предприимчивый житель открыл сеть барбершопов, чтобы помочь мужчинам
ухаживать за их бородами. Однако он никак не может посчитать сколько всего
специалистов-барберов для этого нужно. Вам нужно написать программу которая
будет рассчитывать сколько мужчин можно постричь во всех барбершопах исходя из
следующих данных:

* каждый из 9000 мужчин посещает барбершоп раз в месяц (30 дней)

* один барбер способен обслужить одного клиента за 1 час

* смена барбера — 8 часов

Программа должна спросить сколько мужчин проживает в городе и сколько всего
барберов уже работает во всех барбершопах, и посчитать сколько барберов нужно,
и если их недостаточно — выдать сообщение об этом. Если барберов достаточно —
сказать и об этом.
*/

int barber() {
  int mansCount;
  int barbersCount;

  std::cout << "************** Барбершоп-калькулятор **************\n";
  std::cout << "Введите число мужчин в городе: ";
  std::cin >> mansCount;

  std::cout << "Сколько уже барберов удалось нанять?";
  std::cin >> barbersCount;
  /*
  // Сколько человек нужно постричь за день?
  int mansPerDay = mansCount / 30;
  // Сколько человек может постричь один барбер за одну смену?
  int mansPerBarber = 8; // один человек в час, смена 8 часов
  // Сколько нужно барберов, чтобы постричь mansPerDay человек?
  int requiredBarbersCount = mansPerDay / mansPerBarber;
  std::cout << "Необходимое число барберов: " << requiredBarbersCount << "\n";
  // Сравниваем с количеством имеющихся барберов
  if (requiredBarbersCount > barbersCount){
      std::cout << "Нужно больше барберов!!!\n";
  }

  if (requiredBarbersCount <= barbersCount){
      std::cout << "Барберов хватает!!!\n";
  }
  */

  //------------------------------------------------------------------------

  // Сколько человек может постричь один барбер за одну смену?
  int mansPerBarber = 8; // один человек в час, смена 8 часов
  // Сколько человек успеет постричь барбер за месяц?
  int mansPerBarberPerMonth = mansPerBarber * 30;
  std::cout << "Один барбер стрижет столько клиентов в месяц "
            << mansPerBarberPerMonth << "\n";

  // Сколько нужно барберов, чтобы постричь mansCount человек?
  int requiredBarbersCount = mansCount / mansPerBarberPerMonth;
  if (requiredBarbersCount * mansPerBarberPerMonth < mansCount) {
    requiredBarbersCount += 1;
  }

  std::cout << "Необходимое число барберов: " << requiredBarbersCount << "\n";

  // Сколько человек успеют посчтричь requiredBarbersCount за месяц?
  std::cout << requiredBarbersCount << " барбера могут постричь "
            << requiredBarbersCount * mansPerBarberPerMonth
            << " мужчин за месяц.\n";

  // Сравниваем с количеством имеющихся барберов
  if (requiredBarbersCount > barbersCount) {
    std::cout << "Нужно больше барберов!!!\n";
  } else if (requiredBarbersCount == barbersCount) {
    std::cout << "Барберов ровно столько, сколько нужно!!!\n";
  } /*else {
      std::cout << "Барберов хватает!!!\n";
  }*/

  if (barbersCount > requiredBarbersCount * 2) {
    std::cout
        << "У вас работает в два раза больше барберов, чем это нужно!!!\n";
  }

  /*if ((a * 2) + b <= c){
      // код выполняемый, если условие верно, т.е. выражение (a * 2) + b меньше
  либо равно c
  }*/
  return 0;
}
