#include <iostream>

/*
Задача 4. Военное время.

Во времена Второй Мировой в штабах использовались стеклянные доски. С одной их
стороны специальные люди писали сводки с фронта, а с другой генералы их читали.
Как вы понимаете, для генералов текст выглядел зеркально отраженным, поэтому
специальных людей учили писать задом наперед. Напишите программу, упрощающую им
жизнь: она должна выводить введенное число задом наперед.
*/

int main() {
  int number;
  std::cout << "Введите число: ";
  std::cin >> number;
  int reverseNumber = 0;
  while (number != 0) {
    reverseNumber = reverseNumber * 10 + number % 10;
    number /= 10;
  }
  std::cout << "Число задом наперед: " << reverseNumber << std::endl;
}
