#include <iostream>

/*
Задача 2. Кадастровые проблемы.

В столице программистов на квадратные участки дается скидка. А так как работать
с целыми числами программисты начинают раньше, то и участки, площадь которых
является точным квадратом (например, 25 или 49), являются самыми
востребованными. Напишите программу, которая проверяет, является ли введенная
площадь участка точным квадратом. Самый большой участок в городе имеет площадь в
1 000 000 м2.
*/

int main() {
  int area;
  std::cout << "Введите площадь участка: ";
  std::cin >> area;
  while (area < 1 || area > 1000000) {
    std::cout << "Введите площадь участка: ";
    std::cin >> area;
  } while(area != 0){
    int i = 1;
    while (i * i < area)
      i++;
    if (i * i == area)
      std::cout << "Площадь является точным квадратом" << std::endl;
    else
      std::cout << "Площадь не является точным квадратом" << std::endl;
    break;
  }
}
