#include <iostream>

/*
Задача 2. — Входит... И выходит... И входит... Замечательно выходит! "Винни-Пух
и день забот".

У Винни-Пуха есть кирпич размера A на B на C. А еще есть стена, в которой
проделано прямоугольное отверстие размера X на Y. Прежде чем подарить все это
ослику Иа, Винни-Пух хочет знать, получится ли просунуть этот кирпич в это
отверстие? Напишите программу, которая по данным пяти числам отвечает на этот
вопрос. Разумеется, кирпич можно поворачивать.
*/

int block() {
  std::cout << "Введите размеры кирпича: \n";
  int a, b, c;
  std::cin >> a >> b >> c;
  std::cout << "Введите размеры отверстия: \n";
  int x, y;
  std::cin >> x >> y;
  if ((a <= x && b <= y) || (a <= y && b <= x) || (a <= x && c <= y) ||
      (a <= y && c <= x) || (b <= x && c <= y) || (b <= y && c <= x)) {
    std::cout << "Кирпич пролезет";
  } else {
    std::cout << "Кирпич не пролезет";
  }
  return 0;
}
