#include <iostream>

/*
Задача 1. Координатная плоскость.

Напишите программу, которая принимает на вход координаты X, Y некоторой точки на плоскости и отвечает, в какой четверти плоскости лежит эта точка (а если она лежит на границе двух четвертей — то так и отвечает “на границе”). Напомним, что четверти на плоскости нумеруются так: первая четверть — если обе координаты положительны, вторая — если X отрицателен, а Y положителен, третья — если обе координаты отрицательны, четвертая — если X положителен, а Y отрицателен. Точка лежит на границе четвертей, если хотя бы какая-то из ее координат равна нулю.
*/

int quarter() {
  std::cout << "Веедите X и Y через ввод: ";
  int x, y;
  std::cin >> x >> y;
  if (x > 0 && y > 0) {
    std::cout << "1 четверть";
  }if (x<0 && y>0) {
    std::cout << "2 четверть";
  }if (x<0 && y<0) {
    std::cout << "3 четверть";
  }if (x>0 && y<0) {
    std::cout << "4 четверть";
  }if (x == 0 || y == 0) {
    std::cout << "На границе";
  }
  return 0;
}
