#include <iostream>

/*
Задача 2. Купи слона.

Напишите программу-дразнилку “Купи слона”. Она спрашивает у пользователя, как его зовут, затем отвечает “%username%, купи слона!”. Дальше, что бы он ни говорил, она передразнивает: Все говорят “...”, а ты купи слона!
Так повторяется бесконечно.

Пример
- Хорошо, давай куплю.
- Все говорят “Хорошо, давай куплю.”, а ты купи слона!
*/

int main() {
  std::string username;
  std::cout << "Как тебя зовут?\n";
  std::getline(std::cin, username);
  std::string answer;
  std::cout << username << ", купи слона!\n";
  std::getline(std::cin, answer);
  while (true){
    std::cout << "все говорят \"" << answer << "\", а ты купи слона!\n";
    std::getline(std::cin, answer);
  }
}
