#include <iostream>

/*
Задача 2. Мост и перегрузка.

Через мост разрешено проезжать машинам с массой не больше 1200 килограмм. Для
контроля на каждой полосе на въезде расположены весы. Одновременно на мост
въезжает 4 машины.

Напишите программу, которая получает 4 числа — массу въезжающих машин — и
сообщает, есть ли среди них хоть одна, вес которой превышает 1200 килограмм.
*/

int overload() {
  std::cout << "Введите массу 4 машин: ";
  int m1, m2, m3, m4;
  std::cin >> m1 >> m2 >> m3 >> m4;
  if (m1 > 1200 || m2 > 1200 || m3 > 1200 || m4 > 1200) {
    std::cout << "Внимание! На мосту есть перегруз!";
  }else{
    std::cout << "Все в порядке";
  }
  return 0;
}
