#include <iostream>

/*
Задача 4. Сумма нечётных.
Напишите программу, похожую на разобранный нами пример с суммой чисел, но
только теперь нужно вычислить сумму всех нечётных чисел, лежащих в диапазоне от
единицы до указанного пользователем числа включительно.
*/

int main()
{
    int n;
    std::cout << "Enter your number: ";
    std::cin >> n;

    int sum = 0;
    for (int i = 1; i <= n; i += 2)
    {
        sum += i;
    }

    std::cout << "Odd summ " << n << " is " << sum << std::endl;

    return 0;
}