#include <iostream>

/*
Задание 4. Банкомат — 2
Что нужно сделать
Напишите программу для банкомата.

Условие:

Однажды Вася подошёл к банкомату и захотел обналичить N рублей.

В банкомате есть купюры достоинством 100, 200, 500, 1 000, 2 000 и 5 000 рублей.
Банкомат хочет выдать Васе запрошенную сумму, обойдясь как можно меньшим числом
купюр.

Напишите программу для банкомата, которая по заданному числу N:

решает, сколько купюр каждого номинала нужно выдать (4 по 200, 1 по 1 000) для
получения суммы ровно N рублей; либо говорит, что выдать ровно N рублей
невозможно, например если N не делится на 100. Учтите, что банкомат не может
выдать за один раз более 150 000 рублей.

При попытке запросить такую сумму должно быть выдано сообщение об ошибке.
Например, 800 рублей нужно выдать как 1 по 500, 1 по 200 и ещё 1 по 100.

Советы и рекомендации
Используйте как деление, так и получение остатка от деления.
Постарайтесь выдать самый оптимальный набор купюр.
Помните, что банкомат не может выдать за один раз более 150 000 рублей
*/

int bankMaschine() {
  std::cout << "Введите сумму: ";
  int sum;
  std::cin >> sum;
  if (sum > 150000 || sum % 100 != 0) {
    std::cout << "Ошибка! \n";
    std::cout << "Введите сумму: ";
    std::cin >> sum;
  }
  int count_5000 = sum / 5000;
  sum %= 5000;
  if (count_5000 > 0) {
    std::cout << "5000: " << count_5000 << std::endl;
  }
  int count_2000 = sum / 2000;
  sum %= 2000;
  if (count_2000 > 0) {
    std::cout << "2000: " << count_2000 << std::endl;
  }
  int count_1000 = sum / 1000;
  sum %= 1000;
  if (count_1000 > 0) {
    std::cout << "1000: " << count_1000 << std::endl;
  }
  int count_500 = sum / 500;
  sum %= 500;
  if (count_500 > 0) {
    std::cout << "500: " << count_500 << std::endl;
  }
  int count_200 = sum / 200;
  sum %= 200;
  if (count_200 > 0) {
    std::cout << "200: " << count_200 << std::endl;
  }
  int count_100 = sum / 100;
  sum %= 100;
  if (count_100 > 0) {
    std::cout << "100: " << count_100 << std::endl;
  }
  return 0;
}