#include <iostream>

/*
Задание 1. Полёт нормальный!
Что нужно сделать
Напишите программу для аэропорта, проверяющую, правильным ли эшелоном летит
самолёт.

Условие:

скорость самолёта должна быть в диапазоне от 750 до 850 км/ч;
высота — в диапазоне от 9 000 до 9 500 метров.
*/

int plane() {
    int speed, height;
    std::cout << "Введите скорость и высоту самолета: ";
    std::cin >> speed >> height;
    if (speed >= 750 && speed <= 850 && height >= 9000 && height <= 9500){
        std::cout << "Самолет летит правильным эшелоном";
    }else{
        std::cout << "Самолет летит неправильным эшелоном";
    }
    return 0;
}