#include <iostream>

int task2() {
  /*
    Задача 2. Обмен местами
    Что нужно сделать
    Есть код программы с двумя переменными типа int и выводом этих переменных на
    экран. Напишите программу, которая меняет значения переменных местами, то
    есть нужно добиться того, чтобы в переменной a лежит значение b, а в b     —
    значение a.
  */

  int a = 42;
  std::cout << "a: " << a << "\n"; // положили значение а
  int b = 153;
  std::cout << "b: " << b << "\n"; // положили значение b
  int c = a; // Временная переменная в которую положили значение а
  a = b; // Теперь в переменной a лежит значение переменной b
  b = c; // Теперь в переменной b лежит значение переменной с, в которую мы ложили значение переменной а
  std::cout << "a: " << a << "\n"; // На экран будет выведено 153 //
  std::cout << "b: " << b << "\n"; // На экран будет выведено 42 //
  std::cout << "\n\n\n";
  return 0;
}
