#include <iostream>

int task1() {
  /*
  Задача 1. Симулятор маршрутки
  Что нужно сделать
  Напишите программу, которая симулирует работу маршрутки. Она умеет объявлять
  остановки и узнавать у пользователя, сколько человек вышло и зашло на
  остановке. Пассажиры оплачивают проезд при входе. Работать она должна примерно
  так:

  Прибываем на остановку «Улица программистов». В салоне пассажиров: 0

  Сколько пассажиров вышло на остановке? 0

  Сколько пассажиров зашло на остановке? 3

  Отправляемся с остановки «Улица программистов». В салоне пассажиров: 3

  -----------Едем---------

  Прибываем на остановку «Проспект алгоритмов». В салоне пассажиров: 3

  …

  …


  Маршрут состоит из четырёх остановок. Напишите программу так, чтобы в конце
  она выводила, сколько денег мы заработали при условии, что билет стоит 20
  руб., а расходы следующие:

  четверть — на зарплату водителю;
  пятая часть — на топливо;
  пятая часть — на налоги;
  пятая часть — на ремонт машины.
  Формат вывода (после прибытия на последнюю остановку):

  Всего заработали: 100 руб.

  Зарплата водителя: 25 руб.

  Расходы на топливо: 20 руб.

  Налоги: 20 руб.

  Расходы на ремонт машины: 20 руб.

  Итого доход: 15 руб.
  */

  std::string stops[4] = {"Улица программистов", "Проспект алгоритмов",
                          "Горный переулок", "Перекресток с Бульваром"};
  int passengers = 0;
  int passengersIn = 0;
  int passengersOut = 0;
  int money = 0;
  int ticket = 20;
  int salary = 0;
  int fuel = 0;
  int tax = 0;
  int repair = 0;
  int income = 0;
  int totalIncome = 0;
  int totalSpendings = 0;

  for (int i = 0; i < 4; i++) {
    std::cout << "Прибываем на остановку «" << stops[i]
              << "». В салоне пассажиров: " << passengers;
    std::cout << "\nСколько пассажиров вышло на остановке? ";
    std::cin >> passengersOut;
    std::cout << "Сколько пассажиров зашло на остановке? ";
    std::cin >> passengersIn;
    passengers += passengersIn - passengersOut;
    money = passengersIn * ticket;
    salary = money / 4;
    fuel = money / 5;
    tax = money / 5;
    repair = money / 5;
    income += money - salary - fuel - tax - repair;
    std::cout << "Зарплата водителя: " << salary
              << "\nРасходы на топливо: " << fuel << "\nНалоги: " << tax
              << "\nРасходы на ремонт машины: " << repair
              << "\nИтого доход: " << income;
    std::cout << "\nОтправляемся с остановки «" << stops[i]
              << "». В салоне пассажиров: " << passengers;
    std::cout << "\n-----------Едем---------\n";
    totalIncome += income;
    totalSpendings += salary + fuel + tax + repair;
    std::cout << "Всего потратили: " << totalSpendings << " руб.\n";
  }
  std::cout << "Всего заработали: " << totalIncome << " руб.\n";

  std::cout << "\n\n\n";
  return 0;
}
