#include <iostream>

/*
Задание 7. Сокращение дроби* (дополнительное задание)
Что нужно сделать
Пользователь вводит числа M и N. Напишите программу, которая преобразует дробь
M/N к несократимому виду и выдаёт получившийся результат. Обеспечьте контроль
ввода.

Пример выполнения

            Введите числитель: 4
            Введите знаменатель: 6
            Результат: 2 / 3
            Введите числитель: 25
            Введите знаменатель: 40
            Результат: 5 / 8
            Введите числитель: −6
            Введите знаменатель: 12
            Результат: −1 / 2
(При вводе отрицательных чисел в выводе должен быть только один ведущий минус.
Неправильный вывод программы: 1/−2, −1/−2.) Введите числитель: 896 Введите
знаменатель: 3584 Результат: 1 / 4

Рекомендации по выполнению
Не забывайте о правилах деления чисел. Программа должна работать корректно и не
должна «падать».

Что оценивается
Алгоритм оптимальный, не бесконечный и не очень большой. Программа не зависает.
Правильно определены критерии начала и конца цикла.

*/

int main() {
  int numerator, denominator;
  std::cout << "Введите числитель: ";
  std::cin >> numerator;
  std::cout << "Введите знаменатель: ";
  std::cin >> denominator;
  int number = 0;
  if (denominator == 0) {
    std::cout << "Знаменатель не может быть равен нулю, введите знаменатель:  ";
    std::cin >> denominator;
  }
  if (numerator == 0) {
    std::cout << "Результат: 0";
  }
  if (numerator > denominator) {
    number = numerator / denominator;
    numerator = numerator % denominator;
  }
  int min = numerator;
  while (min > 0) {
    if (numerator % min == 0 && denominator % min == 0) {
      std::cout << "Результат: " << number << " целых " << numerator / min
                << " / " << denominator / min;
      break;
    }
    min--;
  }
}