#include <iostream>

/*
Задание 1. Кукушка
Что нужно сделать
Напишите программу, которая имитировала бы часы с кукушкой. В начале работы она
спрашивает, который час, а затем нужное количество раз пишет «Ку-ку!». При
выполнении задания необходимо обеспечить контроль ввода (например, количество
часов не может быть отрицательным).

Пример выполнения

            Введите, который час: 2
            Ку-ку!
            Ку-ку!

Рекомендации по выполнению
Обратите внимание, если вы захотите использовать 24-часовой формат, в котором
часы имеют значения 0–23, то кукушка не сможет вас оповестить о полночи (нулевой
час).

Что оценивается
Есть проверка входных значений.
Количество выведенных на консоль фраз равно количеству часов.
*/

int main() {
  int hour;
  std::cout << "Введите, который час: ";
  std::cin >> hour;
  while (hour <= 0 || hour > 12) {
    std::cout << "Введите корректное значение: ";
    std::cin >> hour;
  }
  int count = 1;
  while (hour > 0) {
    std::cout << count << " Ку-ку!" << std::endl;
    count++;
    hour--;
  }
}