#include <iostream>

/*
Задание 8. Угадай число* (дополнительное задание)
Что нужно сделать
Напишите программу, которая угадывает число, задуманное пользователем. Число
загадывается в диапазоне от 0 до 63. Программа задаёт вопросы вида «Ваше число
больше такого-то?» и на основе ответов пользователя («да» или «нет») угадывает
число.

Рекомендации по выполнению
В этом задании можно использовать любой алгоритм поиска, но полный перебор всех
64 значений — самый нежелательный из алгоритмов. Есть алгоритм, который
гарантированно даст ответ за семь вопросов. Что оценивается Нет полного перебора
всех чисел. Программа работает только в указанном отрезке и не выходит за его
пределы. При этом есть возможность поменять отрезок поиска без сильных изменений
в коде программы. Допустимые ответы на вопросы — только «да» или «нет».
*/

int main() {
  std::cout << "Загадайте число от 0 до 63.\n";
  std::cout << "Я попробую его угадать за 7 попыток.\n";
  std::cout << "Если ваше число больше моего, то введите 'да'.\n";
  std::cout << "Если ваше число меньше моего, то введите 'нет'.\n";
  std::cout << "Если я угадал, то введите 'угадал'.\n";
  std::cout << "Начнем!\n";
  int min = 0;
  int max = 63;
  int mid = (min + max) / 2;
  std::string answer;
  while (answer != "угадал") {
    std::cout << "Ваше число больше " << mid << "? \n"
              << "Введите 'да', 'нет' или 'угадал': ";
    std::cin >> answer;
    if (answer == "да") {
      min = mid + 1;
    } else if (answer == "нет") {
      max = mid - 1;
    } else if (answer == "угадал") {
      std::cout << "Я угадал!\n";
    } else {
      std::cout << "Неправильный ответ. Введите 'да', 'нет' или 'угадал'.\n";
    }
    mid = (min + max) / 2;
    if (min > max) {
      std::cout << "Вы обманываете!\n";
      break;
    }
  }
}