#include <iostream>

/*
Задание 5. Числа Фибоначчи
Что нужно сделать
Числами Фибоначчи называется следующая последовательность чисел: 1, 1, 2, 3, 5,
8, 13 и так далее (первое число равно 1, второе число равно 1, а каждое
следующее равно сумме двух предыдущих). Напишите программу, которая по данному
номеру N выводит N-е число этой последовательности (если оно не превосходит 2
147 483 647, конечно же). Обеспечьте контроль ввода.

Пример выполнения

            Введите номер последовательности: 1
            Число в последовательности: 1
            Введите номер последовательности: 6
            Число в последовательности: 8

Рекомендации по выполнению
Заметьте, что последовательность Фибоначчи всегда одинаковая. Пользователь
вводит только порядковый номер числа из последовательности. Обратите внимание,
что условие типа if(value > 2147483647) не имеет смысла. Что оценивается
Результатом запроса является число из последовательности Фибоначчи.
Число 1 определяется как первое и второе число последовательности.
*/

int main() {
  int number;
  int first = 1;
  int second = 2;
  int next = 0;
  std::cout << "Введите номер последовательности: ";
  std::cin >> number;
  while (number >= 45) {
    std::cout << "Введите корректный номер последовательности: ";
    std::cin >> number;
  }
  int temp = 3;
  if (number == 1) {
    std::cout << "Число в последовательности: " << first << std::endl;
  } else if (number == 2) {
    std::cout << "Число в последовательности: " << second << std::endl;
  } else {
    while (temp <= number) {
      next = first + second;
      first = second;
      second = next;
      temp++;
    }
    std::cout << "Число в последовательности: " << next << std::endl;
  }
}