#include <iostream>

/*
Задание 5. Кратность числа
Что нужно сделать
Напишите программу, которая проверяет, делится ли одно число на другое без
остатка.
*/

int task5() {
  int a, b;
  std::cout << "Введите ваши 2 числа по очереди через ввод:\n";
  std::cin >> a >> b;
  if (a % b == 0) {
    std::cout << "Число " << a << " кратно числу " << b;
  } else {
    std::cout << "Число " << a << " не кратно числу " << b;
  }
  return 0;
}