#include <iostream>

/*
Задание 4. Калькулятор опыта
Что нужно сделать
Напишите программу, которая определяет уровень персонажа в компьютерной игре.
Пользователь вводит число «очков опыта», а программа вычисляет уровень. Новый
уровень даётся при достижении 1000, 2500 и 5000 «очков опыта». Начальный уровень
равен 1.
*/

int task4() {
  int exp = 0;
  while (true) {
    int expGained;
    std::cout << "Введите количество полученного опыта:\n";
    std::cin >> expGained;
    exp += expGained;
    if (exp >= 5000) {
      std::cout << "Ваш уровень: 4\n"
                << "У вас " << exp << " опыта\n";
      break;
    } else if (exp >= 2500) {
      std::cout << "Ваш уровень: 3\n"
                << "У вас " << exp << " опыта\n";
    } else if (exp >= 1000) {
      std::cout << "Ваш уровень: 2\n"
                << "У вас " << exp << " опыта\n";
    } else {
      std::cout << "Ваш уровень: 1\n"
                << "У вас " << exp << " опыта\n";
    }
  }
  return 0;
}