#include <iostream>

/*
Задание 7. Меню ресторана
Что нужно сделать
Напишите программу, которая выводит меню бизнес-ланча ресторана в зависимости от
дня недели. В меню есть общая часть, а есть уникальная, которая зависит от дня
недели. Пользователь должен ввести номер дня недели — от 1 (понедельник) до 7
(воскресенье), а программа должна вывести на экран день недели и меню этого дня.
*/

int task7()
{
  std::string dayOfWeek[7] = {"Понедельник", "Вторник", "Среда", "Четверг",
                              "Пятница", "Суббота", "Воскресенье"};
  std::string menu[7] = {"Куриный суп, отбивные с картошкой, компот",
                         "Борщ, бефстроганофф, чай",
                         "Солянка, рибай стейк, кофе",
                         "Грибной суп, плов, содовая",
                         "Фахитос, кончилась фантазия, кто - то там",
                         "Пицца, колла, фри",
                         "Котлеты, макароны, чай"};
  int day;
  std::cout << "Введите день недели от 1 до 7:\n";
  std::cin >> day;
  std::cout << "Сегодня " << dayOfWeek[day - 1] << "\n"
            << "Меню: " << menu[day - 1];
  return 0;
}