#include <iostream>

/*
Задание 3. Проверка на чётное число
Что нужно сделать
Напишите программу, которая проверяет, чётное ли число ввел пользователь.

Пример: int remainder = x % 2 (вычисляет остаток от деления `x` на 2).
*/

int task3() {
  int a;
  std::cout << "Введите ваше число:\n";
  std::cin >> a;
  if (a % 2 == 0) {
    std::cout << "Число чётное";
  } else {
    std::cout << "Число нечётное";
  }
  return 0;
}
