#include <iostream>

/*
Задание 6. Улучшим барберов
Что нужно сделать
Помните задачу про барберов из видео 4.3? Кстати, именно оператор % мог помочь
нам с барберами. Перепишите программу про них с его использованием для проверки
на проблему с целочисленным делением.

Напишите программу, которая отвечает на вопрос хватает ли барберов в данном

городе если задано число людей и число барберов, а так же указано, что

один барбер работает 8 часов в день, на одного клиента тратит 1 час

а каждый клиент приходит раз в месяц. Воспользуйтесь для решения проблемы

целочисленного деления оператором %


*/

int task6()
{
  int mansCount;
  int barbersCount;

  std::cout << "************** Барбершоп-калькулятор **************\n";
  std::cout << "Введите число мужчин в городе: ";
  std::cin >> mansCount;

  std::cout << "Сколько уже барберов удалось нанять?\n";
  std::cin >> barbersCount;

  int barbersPossabilities = barbersCount * 8 * 30;
  if (barbersPossabilities >= mansCount)
  {
    std::cout << "Барберов хватает на всех!\n";
  }
  else
  {
    std::cout << "Барберов не хватает. Нужно ещё ";
    if (mansCount % barbersPossabilities != 0)
    {
      std::cout << mansCount / barbersPossabilities + 1;
    }
    else
    {
      std::cout << mansCount / barbersPossabilities;
    }
  }
  return 0;
}