#include <iostream>

/*
Задание 1. Минимум из двух чисел
Что нужно сделать
Напишите программу, которая ищет минимальное значение из двух чисел.
*/

int task1() {
  int a, b;
  std::cout << "Введите ваши 2 числа по очереди через ввод:\n";
  std::cin >> a >> b;
  if (a < b) {
    std::cout << "Минимальное число: " << a;
  } else if (a == b) {
    std::cout << "Числа равны";
  } else {
    std::cout << "Минимальное число: " << b;
  }
  return 0;
}
