#include <iostream>

/*
адание 2. Складываем в уме
Что нужно сделать
Напишите программу которая проверяет то, как вы умеете складывать два числа в
уме. Программа должна выводить два разных сообщения на верный и неверный ответ
пользователя. В последнем случае надо показывать правильный результат.
*/

int task2() {
  int a, b;
  std::cout << "Введите ваши 2 числа по очереди через ввод:\n";
  std::cin >> a >> b;
  std::cout << "Чему равно их произведение?\n" << a << " + " << b << " = ";
  int c;
  std::cin >> c;
  if (c == a + b) {
    std::cout << "Правильно!";
  } else {
    std::cout << "Неправильно! Правильный ответ: " << a * b;
  }
  return 0;
}
